/*
*********************************************************************************************************
*
*	模块名称 : 第5个界面，自平衡演示
*	文件名称 : Window_5.h
*	版    本 : V1.0
*	说    明 : 
*
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2016-11-18 方川  正式发布
*
*	Copyright (C), 2015-2020, 阿波罗科技 www.apollorobot.cn
*
*********************************************************************************************************
*/
#ifndef _WINDOW_5_H
#define _WINDOW_5_H

#include "DIALOG.h"
#include "SongTi12.h"


//export variable
extern WM_HWIN hWin_5;
extern WM_HWIN CreateWindow_5(void);

#endif
/***************************** 阿波罗科技 www.apollorobot.cn (END OF FILE) *********************************/
